using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
//1 - удар рукояткой меча(базовый) - наносит урон(7)
//2 - собачий клык(можно использовать только если надет предмет игрушечная собака) - наносит урон 5 и урон 2 пасивно каждый ход
//3 - поцелуй - хилит на 10 (после нельзя использовать три хода)
//4 - набитый животик(можно использовать только если надет предмет игрушечная собака) - увеличивает защиту от урона на 3 на всю битву
//5 - лютая пятка - ваша пятка сносит 99% здоровья врагу, но наносит 16 урона вам и делает врага неуязвимым 2 хода(самая дорогая способность)
//6 - яд - наносит 2 урона 3 раза(нельзя потом использовать 3 хода)
//7 - молитва - вы просите существа свыше наложить на врага налог на использование своих спец.способностей(при их использовании враг потеряет 30% от своего нынешнего здоровья)(пользоватся нельзя 3 хода но перезарядка начнётся только когда враг получит урон от этой способности)(спец.способность в ходе хода никуда не пропадёт)
//8 - подношка - 2 урона врагу и отсутствие возможности ходить и ходить))))) два хода(нельзя использовать 4 хода)
namespace PRACTICA_WORK_IGRA
{
    internal class SKILLS
    {

    }
}
